function [ux,ut] = fu(Nmesh,j,a4,dx,u)
%计算空间点的函数
if(j>3&&j<Nmesh-1)
    ux=(-a4/10*u(j-3)+(1/2*a4+1/(12*dx))*u(j-2)+(-a4-2/(3*dx))*u(j-1)+a4*u(j)+(2/(3*dx)-a4/2)*u(j+1)+(a4/10-1/(12*dx))*u(j+2));%空间导数差分
    ut=-ux;%时间导数差分
elseif(j==Nmesh-1)
    ux=(-a4/10*u(j-3)+(1/2*a4+1/(12*dx))*u(j-2)+(-a4-2/(3*dx))*u(j-1)+a4*u(j)+(2/(3*dx)-a4/2)*u(j+1)+(a4/10-1/(12*dx))*u(1));%空间循环求导数差分
    ut=-ux;%时间导数差分
elseif(j==Nmesh)
    ux=(-a4/10*u(j-3)+(1/2*a4+1/(12*dx))*u(j-2)+(-a4-2/(3*dx))*u(j-1)+a4*u(j)+(2/(3*dx)-a4/2)*u(1)+(a4/10-1/(12*dx))*u(2));%空间循环求导数差分
    ut=-ux;%时间导数差分
elseif(j==1)
        ux=(-a4/10*u(Nmesh-2)+(1/2*a4+1/(12*dx))*u(Nmesh-1)+(-a4-2/(3*dx))*u(Nmesh)+a4*u(j)+(2/(3*dx)-a4/2)*u(j+1)+(a4/10-1/(12*dx))*u(j+2));%空间导数差分
        ut=-ux;%时间导数差分
elseif(j==2)
        ux=(-a4/10*u(Nmesh-1)+(1/2*a4+1/(12*dx))*u(Nmesh)+(-a4-2/(3*dx))*u(j-1)+a4*u(j)+(2/(3*dx)-a4/2)*u(j+1)+(a4/10-1/(12*dx))*u(j+2));%空间导数差分
        ut=-ux;%时间导数差分
elseif(j==3)
        ux=(-a4/10*u(Nmesh)+(1/2*a4+1/(12*dx))*u(j-2)+(-a4-2/(3*dx))*u(j-1)+a4*u(j)+(2/(3*dx)-a4/2)*u(j+1)+(a4/10-1/(12*dx))*u(j+2));%空间导数差分
        ut=-ux;%时间导数差分
end

